miData.json

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
<SOAP-ENV:Header>
<wsse:Security xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" env:mustUnderstand="1">
<wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Timestamp-d856aeb0-940f-4597-87de-96d8c3f75219">
<wsu:Created>2019-10-02T22:00:57.549Z</wsu:Created>
<wsu:Expires>2019-10-02T22:05:57.549Z</wsu:Expires>
</wsu:Timestamp>
<wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="UsernameToken-3c23aaee-6edb-4049-b7d5-318d8c3f93e5">
<wsse:Username>2427</wsse:Username>
<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">GMOSS-TzVaYK0Y@api.xtime.com</wsse:Password>
<wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">QgxeFKGWGg3oei0m6yob+Q==</wsse:Nonce>
<wsu:Created>2019-10-02T22:00:57.550Z</wsu:Created>
</wsse:UsernameToken>
</wsse:Security>
<wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">HTTPS://apitestptr1.xtime.com:443/gm/scheduling</wsa:To>
<wsa:From xmlns:wsa="http://www.w3.org/2005/08/addressing">GM</wsa:From>
<ns2:payloadManifest xmlns:ns2="http://www.starstandards.org/webservices/2009/transport">
<ns2:manifest contentID="0" element="ProcessServiceVisit" namespaceURI="http://www.starstandard.org/STAR/5" version="5.6.4"/>
</ns2:payloadManifest>
</SOAP-ENV:Header>
<SOAP-ENV:Body>
<ns2:ProcessMessage xmlns:ns2="http://www.starstandards.org/webservices/2009/transport" xmlns:ns3="http://www.starstandard.org/STAR/5" xmlns:ns4="http://www.openapplications.org/oagis/9">
<ns2:payload>
<ns2:content id="0">
<ns3:ProcessServiceVisit languageCode="en-US" releaseID="5.6.4" systemEnvironmentCode="Test" versionID="5.6.4">
<ns3:ApplicationArea>
<ns3:Sender>
<ns3:CreatorNameCode>GM</ns3:CreatorNameCode>
<ns3:SenderNameCode>OSS</ns3:SenderNameCode>
<ns3:DealerNumberID>112998</ns3:DealerNumberID>
<ns3:DealerCountryCode>US</ns3:DealerCountryCode>
</ns3:Sender>
<ns3:CreationDateTime>2019-10-02T18:00:57.227-04:00</ns3:CreationDateTime>
<ns4:Signature/>
<ns3:BODID>d564de30-19c7-4baf-ba43-c9cae60b90b1</ns3:BODID>
<ns3:Destination>
<ns3:DestinationNameCode>X2</ns3:DestinationNameCode>
<ns3:DestinationSoftwareCode>X2</ns3:DestinationSoftwareCode>
<ns3:DestinationSoftware>X2</ns3:DestinationSoftware>
<ns3:DealerNumberID>112998</ns3:DealerNumberID>
<ns3:DealerTargetCountry>US</ns3:DealerTargetCountry>
</ns3:Destination>
</ns3:ApplicationArea>
<ns3:ProcessServiceVisitDataArea>
<ns3:Process>
<ns4:ActionCriteria>
<ns4:ActionExpression actionCode="Add">Add</ns4:ActionExpression>
</ns4:ActionCriteria>
</ns3:Process>
<ns3:ServiceVisit>
<ns3:ServiceVisitHeader>
<ns3:DocumentIdentificationGroup>
<ns3:DocumentIdentification>
<ns3:DocumentID>1200183583</ns3:DocumentID>
</ns3:DocumentIdentification>
</ns3:DocumentIdentificationGroup>
<ns3:CustomerInfo>
<ns3:AppointmentContactParty>
<ns3:SpecifiedPerson>
<ns3:GivenName>Luis</ns3:GivenName>
<ns3:FamilyName>Antonio</ns3:FamilyName>
<ns3:ResidenceAddress>
<ns3:LineOne>Arce 208, Geovillas los Cedros</ns3:LineOne>
<ns3:CityName>Toluca</ns3:CityName>
<ns3:CountryID>US</ns3:CountryID>
<ns3:Postcode>50228</ns3:Postcode>
<ns3:StateOrProvinceCountrySub-DivisionID>AK</ns3:StateOrProvinceCountrySub-DivisionID>
</ns3:ResidenceAddress>
<ns3:TelephoneCommunication>
<ns3:ChannelCode>PHONE</ns3:ChannelCode>
<ns3:CompleteNumber>7222379934</ns3:CompleteNumber>
</ns3:TelephoneCommunication>
<ns3:URICommunication>
<ns3:URIID>luis.malagon96@gmail.com</ns3:URIID>
<ns3:ChannelCode>EMAIL</ns3:ChannelCode>
</ns3:URICommunication>
<ns3:ContactMethodTypeCode>Home Email</ns3:ContactMethodTypeCode>
</ns3:SpecifiedPerson>
<ns3:Privacy>
<ns3:PrivacyIndicator>false</ns3:PrivacyIndicator>
<ns3:PrivacyTypeString>PrivacyPhone</ns3:PrivacyTypeString>
</ns3:Privacy>
<ns3:Privacy>
<ns3:PrivacyIndicator>false</ns3:PrivacyIndicator>
<ns3:PrivacyTypeString>PrivacySMS</ns3:PrivacyTypeString>
</ns3:Privacy>
<ns3:Privacy>
<ns3:PrivacyIndicator>false</ns3:PrivacyIndicator>
<ns3:PrivacyTypeString>PrivacyEmail</ns3:PrivacyTypeString>
</ns3:Privacy>
<ns3:Privacy>
<ns3:PrivacyIndicator>false</ns3:PrivacyIndicator>
<ns3:PrivacyTypeString>PrivacyMail</ns3:PrivacyTypeString>
</ns3:Privacy>
<ns3:Privacy>
<ns3:PrivacyIndicator>false</ns3:PrivacyIndicator>
<ns3:PrivacyTypeString>PrivacyPCM</ns3:PrivacyTypeString>
</ns3:Privacy>
</ns3:AppointmentContactParty>
</ns3:CustomerInfo>
<ns3:VehicleInfo>
<ns3:Vehicle>
<ns3:Model>CT6</ns3:Model>
<ns3:ModelYear>2018</ns3:ModelYear>
<ns3:MakeString>Cadillac</ns3:MakeString>
<ns3:ManufacturerName>Cadillac</ns3:ManufacturerName>
</ns3:Vehicle>
<ns3:InDistanceMeasure unitCode="mile">12000</ns3:InDistanceMeasure>
</ns3:VehicleInfo>
</ns3:ServiceVisitHeader>
<ns3:ServiceVisitDetail>
<ns3:ServiceAppointment>
<ns3:ServiceVisitAppointmentHeader>
<ns3:DocumentIdentificationGroup>
<ns3:DocumentIdentification>
<ns3:DocumentID>0</ns3:DocumentID>
</ns3:DocumentIdentification>
</ns3:DocumentIdentificationGroup>
</ns3:ServiceVisitAppointmentHeader>
<ns3:ServiceVisitAppointmentDetail>
<ns3:Appointment>
<ns3:AppointmentDateTime>2021-05-22T11:00:00.000-04:00</ns3:AppointmentDateTime>
<ns3:AppointmentNotes>Pickup Location: 5th Avenue Dropoff Location: 5th Avenue Additional Comments</ns3:AppointmentNotes>
<ns3:LeadSourceCode>Customer</ns3:LeadSourceCode>
<ns3:AppointmentStatus>SCHEDULED</ns3:AppointmentStatus>
<ns3:AppointmentServiceLane>DEFAULT</ns3:AppointmentServiceLane>
<ns3:AlternateTransportation>CADILLAC_PREMIUM_CONCIERGE</ns3:AlternateTransportation>
<ns3:EndAppointmentDateTime>2021-05-23T08:10:00.000-04:00</ns3:EndAppointmentDateTime>
<ns3:RequestedService>
<ns3:JobNumberString>A</ns3:JobNumberString>
<ns3:RepeatRepairIndicator>false</ns3:RepeatRepairIndicator>
<ns3:JobTypeString>Customer Pay</ns3:JobTypeString>
<ns3:ServiceLaborScheduling>
<ns3:LaborOperationID>GMOSS06</ns3:LaborOperationID>
<ns3:LaborOperationIdTypeCode>GMOSS06</ns3:LaborOperationIdTypeCode>
<ns3:LaborOperationDescription>Rotate Tires</ns3:LaborOperationDescription>
</ns3:ServiceLaborScheduling>
<ns3:CustomerSalesRequestDescription>Bulb or Lighting Concern</ns3:CustomerSalesRequestDescription>
</ns3:RequestedService>
<ns3:RequestedService>
<ns3:JobNumberString>B</ns3:JobNumberString>
<ns3:RepeatRepairIndicator>false</ns3:RepeatRepairIndicator>
<ns3:JobTypeString>Customer Pay</ns3:JobTypeString>
<ns3:ServiceLaborScheduling>
<ns3:LaborOperationID>GMOSS14</ns3:LaborOperationID>
<ns3:LaborOperationIdTypeCode>GMOSS14</ns3:LaborOperationIdTypeCode>
<ns3:LaborOperationDescription>Transmission Diagnosis (Not Shifting Properly,Leaks,Other)</ns3:LaborOperationDescription>
</ns3:ServiceLaborScheduling>
<ns3:CustomerSalesRequestDescription>Transmission Diagnosis (Not Shifting Properly,Leaks,Other)</ns3:CustomerSalesRequestDescription>
</ns3:RequestedService>
<ns3:RequestedService>
<ns3:JobNumberString>3</ns3:JobNumberString>
<ns3:RepeatRepairIndicator>false</ns3:RepeatRepairIndicator>
<ns3:JobTypeString>Customer Pay</ns3:JobTypeString>
<ns3:ServiceLaborScheduling>
<ns3:LaborOperationID>3</ns3:LaborOperationID>
<ns3:LaborOperationIdTypeCode>GMOSSMISC</ns3:LaborOperationIdTypeCode>
<ns3:LaborOperationDescription>Need something else? BOX</ns3:LaborOperationDescription>
</ns3:ServiceLaborScheduling>
<ns3:CustomerSalesRequestDescription>Need something else? BOX</ns3:CustomerSalesRequestDescription>
</ns3:RequestedService>
<ns3:RequestedService>
<ns3:JobNumberString>C</ns3:JobNumberString>
<ns3:RepeatRepairIndicator>false</ns3:RepeatRepairIndicator>
<ns3:JobTypeString>Customer Pay</ns3:JobTypeString>
<ns3:ServiceLaborScheduling>
<ns3:LaborOperationID>4</ns3:LaborOperationID>
<ns3:LaborOperationIdTypeCode>GMOSSMISC</ns3:LaborOperationIdTypeCode>
<ns3:LaborOperationDescription>Car Wash plus Multipoint Inspection</ns3:LaborOperationDescription>
</ns3:ServiceLaborScheduling>
<ns3:CustomerSalesRequestDescription>Car Wash plus Multipoint Inspection</ns3:CustomerSalesRequestDescription>
</ns3:RequestedService>
<ns3:RequestedService>
<ns3:JobNumberString>B</ns3:JobNumberString>
<ns3:RepeatRepairIndicator>false</ns3:RepeatRepairIndicator>
<ns3:JobTypeString>Customer Pay</ns3:JobTypeString>
<ns3:ServiceLaborScheduling>
<ns3:LaborOperationID>1</ns3:LaborOperationID>
<ns3:LaborOperationIdTypeCode>GMOSS12</ns3:LaborOperationIdTypeCode>
<ns3:LaborOperationDescription>CHECK ENGINE LIGHT</ns3:LaborOperationDescription>
</ns3:ServiceLaborScheduling>
<ns3:CustomerSalesRequestDescription>CHECK ENGINE LIGHT</ns3:CustomerSalesRequestDescription>
</ns3:RequestedService>
<ns3:RequestedService>
<ns3:JobNumberString>B</ns3:JobNumberString>
<ns3:RepeatRepairIndicator>false</ns3:RepeatRepairIndicator>
<ns3:JobTypeString>Customer Pay</ns3:JobTypeString>
<ns3:ServiceLaborScheduling>
<ns3:LaborOperationID>1</ns3:LaborOperationID>
<ns3:LaborOperationIdTypeCode>GMOSS:ABS_TEST</ns3:LaborOperationIdTypeCode>
<ns3:LaborOperationDescription>ABS LIGHT DIAGNOSIS</ns3:LaborOperationDescription>
</ns3:ServiceLaborScheduling>
<ns3:CustomerSalesRequestDescription>ABS LIGHT DIAGNOSIS</ns3:CustomerSalesRequestDescription>
</ns3:RequestedService>
<ns3:RequestedService>
<ns3:JobNumberString>B</ns3:JobNumberString>
<ns3:RepeatRepairIndicator>false</ns3:RepeatRepairIndicator>
<ns3:JobTypeString>Customer Pay</ns3:JobTypeString>
<ns3:ServiceLaborScheduling>
<ns3:LaborOperationID>1</ns3:LaborOperationID>
<ns3:LaborOperationIdTypeCode>GMOSS07</ns3:LaborOperationIdTypeCode>
<ns3:LaborOperationDescription>Inspect Battery</ns3:LaborOperationDescription>
</ns3:ServiceLaborScheduling>
<ns3:CustomerSalesRequestDescription>Inspect Battery</ns3:CustomerSalesRequestDescription>
</ns3:RequestedService>
<ns3:ServiceAdvisorParty>
<ns3:PartyID>555185537</ns3:PartyID>
<ns3:DealerManagementSystemID>10</ns3:DealerManagementSystemID>
<ns3:SpecifiedPerson>
<ns3:GivenName>test</ns3:GivenName>
<ns3:FamilyName>advisor</ns3:FamilyName>
</ns3:SpecifiedPerson>
</ns3:ServiceAdvisorParty>
</ns3:Appointment>
</ns3:ServiceVisitAppointmentDetail>
</ns3:ServiceAppointment>
</ns3:ServiceVisitDetail>
</ns3:ServiceVisit>
</ns3:ProcessServiceVisitDataArea>
</ns3:ProcessServiceVisit>
</ns2:content>
</ns2:payload>
</ns2:ProcessMessage>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>